20240401T214231--kdoc-136-『はじめてのosコードリーディング』__book.org
:properties:
:ID: 20240401T214231
:end:
#+title:      KDOC 136: 『はじめてのOSコードリーディング』
#+date:       [2024-04-01 Mon 21:42]
#+filetags:   :book:
#+identifier: 20240401T214231

* この文書のステータス
- 作成
  - [X] 2024-04-01 貴島
- レビュー
  - [X] 2024-04-27 貴島

* 概要
[[https://gihyo.jp/dp/ebook/2013/978-4-7741-5517-3][はじめてのOSコードリーディング　――UNIX V6で学ぶカーネルのしくみ]]はUnixコードリーディングの本。

* メモ
ごく序盤の読み方・理解していくコツのメモ。

- まずは最後まで読んで全体像を把握する
- 仕様書やユーザーズマニュアルを読む
  本書と併せて仕様書やユーザプログラマーズマニュアルを読むと理解が早まる。ソースコードから仕様を理解するのではなく、仕様を理解してからソースコードを読む。

- 構造体をよく見る

  プログラムはあるデータをいかに操作するか、というもの。処理対象の構造体やフラグを見ているだけでどのような処理が行われるのか想像がつくことは多い。

* 関連
- [[id:20240314T212016][KDOC 122: Linuxカーネル知識の全体像を把握する]]。概念理解が、さらなる理解の助けになった部分は多い
