20240401T214231--kdoc-136-『はじめてのosコードリーディング』__book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-10-16 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 136: 『はじめてのOSコードリーディング』</title>
<meta name="author" content="root" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css' /><link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css' /><link rel='stylesheet' href='../css/site.css' /><link rel='stylesheet' href='../roam/css/code.css' /><link rel='stylesheet' href='css/site.css' /><link rel='stylesheet' href='css/code.css' />
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 136: 『はじめてのOSコードリーディング』</h1>

<div id="outline-container-orgae6dcc4" class="outline-2">
<h2 id="orgae6dcc4"><a href="#orgae6dcc4">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-orgae6dcc4">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-04-01 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-04-27 貴島</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgf5be030" class="outline-2">
<h2 id="orgf5be030"><a href="#orgf5be030">概要</a></h2>
<div class="outline-text-2" id="text-orgf5be030">
<p>
<a href="https://gihyo.jp/dp/ebook/2013/978-4-7741-5517-3">はじめてのOSコードリーディング　――UNIX V6で学ぶカーネルのしくみ</a>はUnixコードリーディングの本。
</p>
</div>
</div>

<div id="outline-container-org2ed8b55" class="outline-2">
<h2 id="org2ed8b55"><a href="#org2ed8b55">メモ</a></h2>
<div class="outline-text-2" id="text-org2ed8b55">
<p>
ごく序盤の読み方・理解していくコツのメモ。
</p>

<ul class="org-ul">
<li>まずは最後まで読んで全体像を把握する</li>
<li>仕様書やユーザーズマニュアルを読む
本書と併せて仕様書やユーザプログラマーズマニュアルを読むと理解が早まる。ソースコードから仕様を理解するのではなく、仕様を理解してからソースコードを読む。</li>

<li><p>
構造体をよく見る
</p>

<p>
プログラムはあるデータをいかに操作するか、というもの。処理対象の構造体やフラグを見ているだけでどのような処理が行われるのか想像がつくことは多い。
</p></li>
</ul>
</div>
</div>

<div id="outline-container-orge8dd9ef" class="outline-2">
<h2 id="orge8dd9ef"><a href="#orge8dd9ef">関連</a></h2>
<div class="outline-text-2" id="text-orge8dd9ef">
<ul class="org-ul">
<li><a href="20240314T212016--kdoc-122-linuxカーネル知識の全体像を把握する__essay.html#ID-20240314T212016">KDOC 122: Linuxカーネル知識の全体像を把握する</a>。概念理解が、さらなる理解の助けになった部分は多い</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer><script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js"/>
</div>
</body>
</html>
